Тест_ЗУП_31_КОРП/src/InformationRegisters/ИзученныеЭлементыЭлектронныхКурсов/ИзученныеЭлементыЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзученныеЭлементыЭлектронныхКурсов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Изучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяИзученияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>DefinedType.КонтекстЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>DefinedType.УчащийсяЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАктивности</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИзучениеЭлектронногоКурса</name>
    <type>
      <types>DocumentRef.ИзучениеЭлектронногоКурса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ИзученныеЭлементыЭлектронныхКурсов/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Получает все завершенные попытки тестов
//
Функция ПройденныеТесты(Учащийся, Контекст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзученныеЭлементыЭлектронныхКурсов.Период КАК Дата,
		|	ИзученныеЭлементыЭлектронныхКурсов.Результат,
		|	ИзученныеЭлементыЭлектронныхКурсов.ВыставляетсяОценка,
		|	ИзученныеЭлементыЭлектронныхКурсов.ПроверяетсяПреподавателем,
		|	ИзученныеЭлементыЭлектронныхКурсов.ПроверенПреподавателем,
		|	ИзученныеЭлементыЭлектронныхКурсов.ДатаНачала,
		|	ИзученныеЭлементыЭлектронныхКурсов.ДатаОкончания,
		|	ИзученныеЭлементыЭлектронныхКурсов.Регистратор КАК СессияВыполненияТеста,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлементСодержания,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлементСодержания.Наименование КАК НаименованиеЭлементаСодержания,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлектронныйКурс,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлектронныйКурс.Наименование КАК НаименованиеЭлектронногоРесурса
		|ИЗ
		|	РегистрСведений.ИзученныеЭлементыЭлектронныхКурсов КАК ИзученныеЭлементыЭлектронныхКурсов
		|ГДЕ
		|	ИзученныеЭлементыЭлектронныхКурсов.Учащийся = &Учащийся
		|	И ИзученныеЭлементыЭлектронныхКурсов.Контекст = &Контекст
		|	И ИзученныеЭлементыЭлектронныхКурсов.ЭтоТест = ИСТИНА
		|	И ИзученныеЭлементыЭлектронныхКурсов.Завершено = ИСТИНА";
	
	Запрос.УстановитьПараметр("Учащийся", Учащийся);
	Запрос.УстановитьПараметр("Контекст", Контекст);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция ЭлементСодержанияПройден(ЭлементСодержания, ИзучениеЭлектронногоКурса) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлементСодержания)
		ИЛИ НЕ ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда
		
		Возврат Ложь;

	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИзученныеЭлементыЭлектронныхКурсов.Регистратор
		|ИЗ
		|	РегистрСведений.ИзученныеЭлементыЭлектронныхКурсов КАК ИзученныеЭлементыЭлектронныхКурсов
		|ГДЕ
		|	ИзученныеЭлементыЭлектронныхКурсов.ИзучениеЭлектронногоКурса = &ИзучениеЭлектронногоКурса
		|	И ИзученныеЭлементыЭлектронныхКурсов.ЭлементСодержания = &ЭлементСодержания
		|	И ИзученныеЭлементыЭлектронныхКурсов.Завершено = ИСТИНА";
	
	Запрос.УстановитьПараметр("ИзучениеЭлектронногоКурса", ИзучениеЭлектронногоКурса);
	Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
	
	УстановитьПривилегированныйРежим(Истина); // Для доступа учащимся
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
